Table of Contents
 Enum CalculationType
Namespace
IdeaRS.OpenModel.Concrete.CheckResult
Assembly
IdeaRS.OpenModel.dll
Calculation type
public enum CalculationType
Fields
Baumann = 25
calculation internal forces for slabs/shells/walls
BrittleFailure = 17
brittle failure check
Capacity = 1
calculation of capacity by the interaction diagram
CapacityMesh = 43
interaction diagram on mesh
ColumnForces = 27
Recalculation of internal forces on compression members (effect of geometric imperfections and second order effect).
ConcreteCover = 35
calculation of creep and shrinkage
CrackWidthLong = 11
crack width check - long
CrackWidthShort = 10
crack width check - short
CrackWidthStage = 12
crack width check - stage
CrackingCalculation = 36
calculation if cross section is cracked
CrackingCalculationLong = 38
calculation if cross section is cracked
CrackingCalculationShort = 37
calculation if cross section is cracked
CreepAndShrinkageCoefficient = 34
calculation of creep and shrinkage
CrossSectionCharacteristicsLong = 23
calculation cross-section characteristics - long
CrossSectionCharacteristicsShort = 22
calculation cross-section characteristics - short
CrossSectionCharacteristicsStage = 24
calculation cross-section characteristics - stage
Deflection = 16
deflection check
DesignReinforcement = 42
desing of reinforcement
Detailing = 18
detailing check
Fatigue = 6
calculation - response for fatigue
InitilaStateofCrossSection = 40
initial state of cross-section
Interaction = 5
interaction shear+torsion
LinearStressLong = 20
Linear stress check - long
LinearStressShort = 19
Linear stress check - short
LinearStressStage = 21
Linear stress check - stage
LongTermLosses = 30
calculation long term losses calculation
LongTermLossesCoefficient = 45
calculation long-term losses coefficient
MNKappaDiagramSLSLong = 33
calculation M-N-Kappa diagram SLS-long
MNKappaDiagramSLSShort = 32
calculation M-N-Kappa diagram SLS-short
MNKappaDiagramULS = 31
calculation M-N-Kappa diagram ULS
NotDefined = 0
not defined check
OverallColumnRecalculation = 26
all internal forces are recalculated because of slenderness/imperfections etc...
PrestressEffects = 28
calculation prestress effects
Primaryforces = 29
calculation primary forces
Redistribution = 39
calculation of redistribution
Response = 2
calculation plane of deformation
Shear = 3
shear check
StiffnessLong = 14
stiffness calculation - long
StiffnessShort = 13
stiffness calculation - short
StiffnessStage = 15
stiffness calculation - stage
StiffnessStageLong = 44
calculation siffness with effective modulus of elasticity
StressLimitationLong = 8
stress limitation check - long
StressLimitationShort = 7
stress limitation check - short
StressLimitationStage = 9
stress limitation check - stage
StrutAngle = 41
angle of concrete strut
Torsion = 4
torsion check
Fields
 Name |  Description
 Baumann = 25
calculation internal forces for slabs/shells/walls
 BrittleFailure = 17
brittle failure check
 Capacity = 1
calculation of capacity by the interaction diagram
 CapacityMesh = 43
interaction diagram on mesh
 ColumnForces = 27
Recalculation of internal forces on compression members (effect of geometric imperfections and second order effect).
 ConcreteCover = 35
calculation of creep and shrinkage
 CrackWidthLong = 11
crack width check - long
 CrackWidthShort = 10
crack width check - short
 CrackWidthStage = 12
crack width check - stage
 CrackingCalculation = 36
calculation if cross section is cracked
 CrackingCalculationLong = 38
calculation if cross section is cracked
 CrackingCalculationShort = 37
calculation if cross section is cracked
 CreepAndShrinkageCoefficient = 34
calculation of creep and shrinkage
 CrossSectionCharacteristicsLong = 23
calculation cross-section characteristics - long
 CrossSectionCharacteristicsShort = 22
calculation cross-section characteristics - short
 CrossSectionCharacteristicsStage = 24
calculation cross-section characteristics - stage
 Deflection = 16
deflection check
 DesignReinforcement = 42
desing of reinforcement
 Detailing = 18
detailing check
 Fatigue = 6
calculation - response for fatigue
 InitilaStateofCrossSection = 40
initial state of cross-section
 Interaction = 5
interaction shear+torsion
 LinearStressLong = 20
Linear stress check - long
 LinearStressShort = 19
Linear stress check - short
 LinearStressStage = 21
Linear stress check - stage
 LongTermLosses = 30
calculation long term losses calculation
 LongTermLossesCoefficient = 45
calculation long-term losses coefficient
 MNKappaDiagramSLSLong = 33
calculation M-N-Kappa diagram SLS-long
 MNKappaDiagramSLSShort = 32
calculation M-N-Kappa diagram SLS-short
 MNKappaDiagramULS = 31
calculation M-N-Kappa diagram ULS
 NotDefined = 0
not defined check
 OverallColumnRecalculation = 26
all internal forces are recalculated because of slenderness/imperfections etc...
 PrestressEffects = 28
calculation prestress effects
 Primaryforces = 29
calculation primary forces
 Redistribution = 39
calculation of redistribution
 Response = 2
calculation plane of deformation
 Shear = 3
shear check
 StiffnessLong = 14
stiffness calculation - long
 StiffnessShort = 13
stiffness calculation - short
 StiffnessStage = 15
stiffness calculation - stage
 StiffnessStageLong = 44
calculation siffness with effective modulus of elasticity
 StressLimitationLong = 8
stress limitation check - long
 StressLimitationShort = 7
stress limitation check - short
 StressLimitationStage = 9
stress limitation check - stage
 StrutAngle = 41
angle of concrete strut
 Torsion = 4
torsion check
 Edit this page